# <span style="color:#d3d1df">Ms Thesis Wage Data Discovery</span>

## <span style="color:#f1c232">Overview:</span>

**To-Do's:** <br>
*Data Discovery for:*

 1. <span style="color:#00ff21">Wage Data</span>
 2. Employment Data
 3. Trade Data
 4. FDI and FPI Data
 5. Decomposed Output Data
 6. Penn Table *(Controls)*

## <span style="color:#f1c232">Environment:</span>

In [1]:
#Packages

import pandas as pd
from Utilities import wages 
import eurostat
import os

#Variables

dl=os.getcwd()[:-32]+'Data/Technology-Trade-Employment'

EARN_SES_14=["EARN_SES_AGT14","EARN_SES06_14","EARN_SES10_14","EARN_SES14_14","EARN_SES18_14"]

EARN_SES_47=["EARN_SES06_47","EARN_SES10_47","EARN_SES14_47","EARN_SES18_47"]

EARN_SES_16=["EARN_SES_AGT16","EARN_SES06_16","EARN_SES10_16","EARN_SES14_16","EARN_SES18_16"]

## <span style="color:#f1c232">Wage Data</span>

Before discovering the data it is convenient to explain the datasets that will be used in the analysis briefly.
Studies conducted in the field of wage premia generally rely on population surveys to analyze premiums on more categories such as gender, age group, economic activity, and most importantly, occupation. European-level population surveys are conducted once in 4 years accessible from 2002 to 2018 with the name: ***"Structure of Earnings Survey (SES)"***. It is important to mention that the original, or raw, survey data is disaggregated *(individual level)* and not open for public access. It is possible to obtain the so-called **microdata** with the proper request, though due to extended delivery time and short thesis deadline, this research will be conducted by aggregated *(by certain categories)* datasets of **Eurostat**.

After browsiÌ‡ng the Eurostat Database, I ended up with the following three different data sets for the years 2002, 2006, 2010, 2014, 2018:

* Mean hourly earnings by sex, economic activity and occupation *(Not available for 2002)*,
* Mean hourly earnings by sex, age, occupation,
* Mean hourly earnings by economic activity, sex, educational attainment level

Among the three datasets listed above, the first one would be the most proper selection for my research since it contains the necessary categories: economic activity, and occupation. While the need for occupation category is strait forward, the introduction of economic activity to analysis is motivated by the following hypothesises:

* First the offshoring

### <span style="color:#b70101">**Mean hourly earnings by sex, economic activity and occupation**</span>

In [3]:
wages.cat_describer(EARN_SES_47).pivot(index="Category", columns=["Dataset","Year"], values=["#ofUniques","Uniques"])

            #ofUniques
Dataset  EARN_SES06_47 EARN_SES10_47 EARN_SES14_47 EARN_SES18_47
Year              2006          2010          2014          2018
Category
currency           NaN             3             4           NaN  \
freq                 1             1             1             1
geo                 35            39            40            41
indic_se             4             4             4             3
isco08             NaN            13            13            14
isco88              14           NaN           NaN           NaN
nace_r1             22           NaN           NaN           NaN
nace_r2            NaN            29            29            29
sex                  3             3             3             3
sizeclas             2             2             2             2
unit                 3           NaN           NaN             4

                                                    Uniques
Dataset                                       EARN_SES06_47
Year                                                   2006
Category
currency                                                NaN  \
freq                                                    [A]
geo       [EU27_2007, EU25, EU15, EA16, EA13, BE, BG, CZ...
indic_se                     [ERN, E_F_M_PC, OPAY, OP_E_PC]
isco08                                                  NaN
isco88    [TOTAL, ISCO1-5, ISCO1, ISCO2, ISCO3, ISCO4, I...
nace_r1   [C-O, C-O_X_L, C-K, C-F, C-E, C, D, E, F, G-K,...
nace_r2                                                 NaN
sex                                               [T, M, F]
sizeclas                                      [TOTAL, GE10]
unit                                         [EUR, PPS, PC]


Dataset                                       EARN_SES10_47
Year                                                   2010
Category
currency                                     [EUR, PPS, PC]  \
freq                                                    [A]
geo       [EU28, EU27_2007, EU25, EU15, EA17, EA13, BE, ...
indic_se                     [ERN, E_F_M_PC, OPAY, OP_E_PC]
isco08    [TOTAL, OC1-5, OC1, OC2, OC3, OC4, OC5, OC6, O...
isco88                                                  NaN
nace_r1                                                 NaN
nace_r2   [B-S, B-S_X_O, B-N, B-F, B-E, B, C, D, E, F, G...
sex                                               [T, M, F]
sizeclas                                      [TOTAL, GE10]
unit                                                    NaN


Dataset                                       EARN_SES14_47
Year                                                   2014
Category
currency                                [EUR, PPS, PC, NAC]  \
freq                                                    [A]
geo       [EU28, EU27_2007, EA19, EA18, EA17, BE, BG, CZ...
indic_se                     [ERN, E_F_M_PC, OPAY, OP_E_PC]
isco08    [TOTAL, OC1-5, OC1, OC2, OC3, OC4, OC5, OC6, O...
isco88                                                  NaN
nace_r1                                                 NaN
nace_r2   [B-S, B-S_X_O, B-N, B-F, B-E, B, C, D, E, F, G...
sex                                               [T, M, F]
sizeclas                                      [TOTAL, GE10]
unit                                                    NaN


Dataset                                       EARN_SES18_47
Year                                                   2018
Category
currency                                                NaN
freq                                                    [A]
geo       [EU27_2020, EU28, EU27_2007, EA19, EA18, EA17,...
indic_se                               [ERN, OPAY, OP_E_PC]
isco08    [TOTAL, OC1-5, OC1, OC2, OC3, OC4, OC5, OC6-8,...
isco88                                                  NaN
nace_r1                                                 NaN
nace_r2   [B-S, B-S_X_O, B-N, B-F, B-E, B, C, D, E, F, G...
sex                                               [T, M, F]
sizeclas                                      [TOTAL, GE10]
unit                                    [EUR, NAC, PPS, PC]

### <span style="color:#b70101">**Mean hourly earnings by sex, age, occupation**</span>

As fololows:</br>
</br>

| Dataset Code  | Year | Dataset Name                                                                   | Source                                 | Metada                                                                |
|---------------|------|--------------------------------------------------------------------------------|----------------------------------------|-----------------------------------------------------------------------|
| EARN_SES_AGT14 | 2002 | Mean hourly earnings by sex, age, occupation    | The Structure of Earnings Survey (SES) | https://ec.europa.eu/eurostat/cache/metadata/en/earn_ses_esms.htm   |
| EARN_SES06_14 | 2006 | Mean hourly earnings by sex, age, occupation - NACE Rev. 1.1, C-O excluding    | The Structure of Earnings Survey (SES) | https://ec.europa.eu/eurostat/cache/metadata/en/earn_ses06_esms.htm   |
| EARN_SES10_14 | 2010 | Mean hourly earnings by sex, age and occupation - NACE Rev. 2, B-S excluding O | The Structure of Earnings Survey (SES) | https://ec.europa.eu/eurostat/cache/metadata/en/earn_ses2010_esms.htm |
| EARN_SES14_14 | 2014 | Mean hourly earnings by sex, age and occupation - NACE Rev. 2, B-S excluding O | The Structure of Earnings Survey (SES) | https://ec.europa.eu/eurostat/cache/metadata/en/earn_ses2014_esms.htm |
| EARN_SES18_14 | 2018 | Mean hourly earnings by sex, age and occupation - NACE Rev. 2, B-S excluding O | The Structure of Earnings Survey (SES) | https://ec.europa.eu/eurostat/cache/metadata/en/earn_ses2018_esms.htm |

</br>
We can describe the categories in these datasets as follows:

In [2]:
wages.cat_explorer(EARN_SES_14).pivot(index="Category", columns=["Dataset","Year"], values=["#ofUniques","Uniques"])

             #ofUniques
Dataset  EARN_SES_AGT14 EARN_SES06_14 EARN_SES10_14 EARN_SES14_14
Year               2002          2006          2010          2014
Category
age                   7             7             6             8  \
currency            NaN           NaN             3             4
freq                  1             1             1             1
geo                  34            35            40            40
indic_se              4             4             4             4
isco08              NaN           NaN            13            13
isco88               13            14           NaN           NaN
sex                   3             3             3             3
sizeclas            NaN             2             2             2
unit                  3             3           NaN           NaN

                                                                  Uniques
Dataset  EARN_SES18_14                                     EARN_SES_AGT14
Year              2018                                               2002
Category
age                  5  [TOTAL, Y_LT30, Y30-39, Y40-49, Y50-59, Y_GE60...  \
currency           NaN                                                NaN
freq                 1                                                [A]
geo                 41  [EU25, EU15, NMS10, EA, EA12, BE, BG, CZ, DK, ...
indic_se             3                     [ERN, E_F_M_PC, OPAY, OP_E_PC]
isco08              14                                                NaN
isco88             NaN  [TOTAL, ISCO1-5, ISCO1, ISCO2, ISCO3, ISCO4, I...
sex                  3                                          [T, M, F]
sizeclas             2                                                NaN
unit                 4                                     [EUR, PPS, PC]


Dataset                                       EARN_SES06_14
Year                                                   2006
Category
age       [TOTAL, Y_LT30, Y30-39, Y40-49, Y50-59, Y_GE60...  \
currency                                                NaN
freq                                                    [A]
geo       [EU27_2007, EU25, EU15, EA16, EA13, BE, BG, CZ...
indic_se                     [ERN, E_F_M_PC, OPAY, OP_E_PC]
isco08                                                  NaN
isco88    [TOTAL, ISCO1-5, ISCO1, ISCO2, ISCO3, ISCO4, I...
sex                                               [T, M, F]
sizeclas                                      [TOTAL, GE10]
unit                                         [EUR, PPS, PC]


Dataset                                       EARN_SES10_14
Year                                                   2010
Category
age         [TOTAL, Y_LT30, Y30-39, Y40-49, Y50-59, Y_GE60]  \
currency                                     [EUR, PPS, PC]
freq                                                    [A]
geo       [EU28, EU27_2007, EU25, EU15, EA17, EA16, EA13...
indic_se                     [ERN, E_F_M_PC, OPAY, OP_E_PC]
isco08    [TOTAL, OC1-5, OC1, OC2, OC3, OC4, OC5, OC6, O...
isco88                                                  NaN
sex                                               [T, M, F]
sizeclas                                      [TOTAL, GE10]
unit                                                    NaN


Dataset                                       EARN_SES14_14
Year                                                   2014
Category
age       [TOTAL, Y_LT30, Y30-39, Y30-49, Y40-49, Y50-59...  \
currency                                [EUR, PPS, PC, NAC]
freq                                                    [A]
geo       [EU28, EU27_2007, EA19, EA18, EA17, BE, BG, CZ...
indic_se                     [ERN, E_F_M_PC, OPAY, OP_E_PC]
isco08    [TOTAL, OC1-5, OC1, OC2, OC3, OC4, OC5, OC6, O...
isco88                                                  NaN
sex                                               [T, M, F]
sizeclas                                      [TOTAL, GE10]
unit                                                    NaN


Dataset                                       EARN_SES18_14
Year                                                   2018
Category
age                    [TOTAL, Y_LT30, Y30-49, Y_GE50, UNK]
currency                                                NaN
freq                                                    [A]
geo       [EU27_2020, EU28, EU27_2007, EA19, EA18, EA17,...
indic_se                               [ERN, OPAY, OP_E_PC]
isco08    [TOTAL, OC1-5, OC1, OC2, OC3, OC4, OC5, OC6-8,...
isco88                                                  NaN
sex                                               [T, M, F]
sizeclas                                      [TOTAL, GE10]
unit                                    [EUR, NAC, PPS, PC]

* age
* currency-unit
* freq
* geo
* indic_se
* isco08-isco88
* sex
* sizeclas

In [15]:
eurostat.get_dic('EARN_SES06_14','indic_se', full=False,)

[('ERN', 'Gross earnings'),
 ('E_F_M_PC', 'Gross earnings of women as a percentage of those of men'),
 ('OPAY', 'Overtime pay'),
 ('OP_E_PC', 'Overtime pay as a percentage of earnings')]

In [19]:
eurostat.get_dic('EARN_SES06_14','isco88', full=False,)

[('TOTAL', 'Total'),
 ('ISCO1-5', 'Non manual workers'),
 ('ISCO1', 'Legislators, senior officials and managers'),
 ('ISCO2', 'Professionals'),
 ('ISCO3', 'Technicians and associate professionals'),
 ('ISCO4', 'Clerks'),
 ('ISCO5', 'Service workers and shop and market sales workers'),
 ('ISCO6', 'Skilled agricultural and fishery workers'),
 ('ISCO7-9', 'Manual workers'),
 ('ISCO7', 'Craft and related trades workers'),
 ('ISCO8', 'Plant and machine operators and assemblers'),
 ('ISCO9', 'Elementary occupations'),
 ('ISCO0', 'Armed forces'),
 ('UNK', 'Unknown')]

In [20]:
eurostat.get_dic('EARN_SES18_14','unit', full=False,)

[('EUR', 'Euro'),
 ('NAC', 'National currency'),
 ('PPS', 'Purchasing power standard (PPS)'),
 ('PC', 'Percentage')]

### Flag Check

For potential problems, it is good to check the data quality prior. Thereby we will import the data including the Flags which are:
 * b = break in time series, c = confidential, d = definition differs, see metadata, e = estimated, f = forecast, n = not significant, p = provisional, r = revised, s = Eurostat estimate, u = low reliability, z = not applicable.

I will check  ***n,p,u*** among these flags for wage and employment data from Eurostat and record it to the data catalog.

In [75]:
pd.unique(eurostat.get_data_df('EARN_SES_AGT14',True)["geo\TIME_PERIOD"])

array(['CZ', 'EA', 'EU15', 'EU25', 'LT', 'NL', 'NMS10', 'NO', 'SI', 'AT',
       'BE', 'BG', 'CY', 'DE', 'DK', 'EA12', 'EE', 'EL', 'ES', 'FI', 'FR',
       'HU', 'IE', 'IS', 'IT', 'LU', 'LV', 'MT', 'PL', 'PT', 'RO', 'SE',
       'SK', 'UK'], dtype=object)

In [56]:
df.dtypes

freq                       object
age                        object
unit                       object
isco88                     object
indic_se                   object
sex                        object
geo\TIME_PERIOD            object
2002_value                float64
2002_flag                  object
f                  string[python]
dtype: object

In [55]:
# Convert the "2002_flag" column to string type
df['f'] = df['2002_flag'].astype("string")

In [67]:
df.query('f == "s"').groupby(['geo\TIME_PERIOD'])['unit'].count()

geo\TIME_PERIOD
EA12    672
EU15    672
EU25    672
Name: unit, dtype: int64

Start by importing *Eurostat **EARN_SES_AGT14** Mean hourly earnings by sex, age, occupation for 2002* ðŸ“€

In [17]:
df02 = pd.read_csv(f'{dl}/Eurostat/csv/EARN_SES_AGT14.csv')
df02.dtypes

DATAFLOW        object
LAST UPDATE     object
freq            object
age             object
unit            object
isco88          object
indic_se        object
sex             object
geo             object
TIME_PERIOD      int64
OBS_VALUE      float64
OBS_FLAG        object
dtype: object

In [ ]:
df02.describe(include='all')[0:2]

,DATAFLOW,LAST UPDATE,freq,age,unit,isco88,indic_se,sex,geo,TIME_PERIOD,OBS_VALUE,OBS_FLAG
count,36286,36286,36286,36286,36286,36286,36286,36286,36286,36286.0,36286.0,2016
unique,1,1,1,7,3,13,4,3,34,NaN,NaN,1

In [ ]:
print(df02["freq"].unique())
print(df02["age"].unique())
print(df02["unit"].unique())
print(df02["isco88"].unique())
print(df02["indic_se"].unique())
print(df02["sex"].unique())
print(df02["geo"].unique())
print(df02["TIME_PERIOD"].unique())

['A']
['TOTAL' 'UNK' 'Y30-39' 'Y40-49' 'Y50-59' 'Y_GE60' 'Y_LT30']
['EUR' 'PC' 'PPS']
['ISCO0' 'ISCO1' 'ISCO1-5' 'ISCO2' 'ISCO3' 'ISCO4' 'ISCO5' 'ISCO7'
 'ISCO7-9' 'ISCO8' 'ISCO9' 'TOTAL' 'UNK']
['ERN' 'OPAY' 'E_F_M_PC' 'OP_E_PC']
['F' 'M' 'T']
['CZ' 'EA' 'EU15' 'EU25' 'LT' 'NL' 'NMS10' 'NO' 'SI' 'AT' 'BE' 'BG' 'CY'
 'DE' 'DK' 'EA12' 'EE' 'EL' 'ES' 'FI' 'FR' 'HU' 'IE' 'IS' 'IT' 'LU' 'LV'
 'MT' 'PL' 'PT' 'RO' 'SE' 'SK' 'UK']
[2002]

In [ ]:
df06 = pd.read_csv(f'{cwd}Data/Eurostat/csv/EARN_SES06_14.csv')
df06.dtypes

DATAFLOW        object
LAST UPDATE     object
freq            object
sizeclas        object
age             object
unit            object
isco88          object
indic_se        object
sex             object
geo             object
TIME_PERIOD      int64
OBS_VALUE      float64
OBS_FLAG        object
dtype: object

In [ ]:
df06.describe(include='all')[0:2]

,DATAFLOW,LAST UPDATE,freq,sizeclas,age,unit,isco88,indic_se,sex,geo,TIME_PERIOD,OBS_VALUE,OBS_FLAG
count,61614,61614,61614,61614,61614,61614,61614,61614,61614,61614,61614.0,54440.0,7595
unique,1,1,1,2,7,3,14,4,3,35,NaN,NaN,2

In [ ]:
print(df06["freq"].unique())
print(df06["sizeclas"].unique())
print(df06["age"].unique())
print(df06["unit"].unique())
print(df06["isco88"].unique())
print(df06["indic_se"].unique())
print(df06["sex"].unique())
print(df06["geo"].unique())
print(df06["TIME_PERIOD"].unique())

['A']
['GE10' 'TOTAL']
['TOTAL' 'UNK' 'Y30-39' 'Y40-49' 'Y50-59' 'Y_GE60' 'Y_LT30']
['EUR' 'PC' 'PPS']
['ISCO0' 'ISCO1' 'ISCO1-5' 'ISCO2' 'ISCO3' 'ISCO4' 'ISCO5' 'ISCO6' 'ISCO7'
 'ISCO7-9' 'ISCO8' 'ISCO9' 'TOTAL' 'UNK']
['ERN' 'OPAY' 'E_F_M_PC' 'OP_E_PC']
['F' 'M' 'T']
['DK' 'EA13' 'EA16' 'EL' 'EU15' 'EU25' 'EU27_2007' 'HU' 'LT' 'NL' 'NO'
 'FI' 'AT' 'BE' 'BG' 'CY' 'CZ' 'DE' 'EE' 'ES' 'FR' 'IE' 'IS' 'IT' 'LU'
 'LV' 'MT' 'PL' 'PT' 'RO' 'SE' 'SI' 'SK' 'TR' 'UK']
[2006]

Start by importing *Eurostat **EARN_SES10_14** Mean hourly earnings by sex, age, occupation for 2010* ðŸ“€

In [83]:
df10 = pd.read_csv(f'{cwd}Data/Eurostat/csv/EARN_SES10_14.csv')
df10.dtypes

DATAFLOW        object
LAST UPDATE     object
freq            object
currency        object
indic_se        object
sizeclas        object
isco08          object
age             object
sex             object
geo             object
TIME_PERIOD      int64
OBS_VALUE      float64
OBS_FLAG        object
dtype: object

In [86]:
df10.describe(include='all')[0:2]

,DATAFLOW,LAST UPDATE,freq,currency,indic_se,sizeclas,isco08,age,sex,geo,TIME_PERIOD,OBS_VALUE,OBS_FLAG
count,64628,64628,64628,64628,64628,64628,64628,64628,64628,64628,64628.0,63152.0,6223
unique,1,1,1,3,4,2,13,6,3,40,NaN,NaN,3

In [114]:
for i in df10.dtypes[df10.dtypes != "float64"].index:
    print(i)

DATAFLOW
LAST UPDATE
freq
currency
indic_se
sizeclas
isco08
age
sex
geo
TIME_PERIOD
OBS_FLAG

In [109]:
for i in df10.dtypes.index:
    print(i)

DATAFLOW
LAST UPDATE
freq
currency
indic_se
sizeclas
isco08
age
sex
geo
TIME_PERIOD
OBS_VALUE
OBS_FLAG

In [115]:
for i in df10.dtypes.index:
    print(df10[i].unique())

['ESTAT:EARN_SES10_14(1.0)']
['30/01/17 23:00:00']
['A']
['EUR' 'PC' 'PPS']
['ERN' 'OPAY' 'E_F_M_PC' 'OP_E_PC']
['GE10' 'TOTAL']
['OC0' 'OC1' 'OC1-5' 'OC2' 'OC3' 'OC4' 'OC5' 'OC6' 'OC7' 'OC7-9' 'OC8'
 'OC9' 'TOTAL']
['TOTAL' 'Y30-39' 'Y40-49' 'Y50-59' 'Y_GE60' 'Y_LT30']
['F' 'M' 'T']
['EU25' 'EU27_2007' 'EU28' 'HU' 'EA13' 'EA16' 'EA17' 'EU15' 'HR' 'NL' 'NO'
 'SI' 'AT' 'BE' 'BG' 'CH' 'CY' 'CZ' 'DE' 'DK' 'EE' 'EL' 'ES' 'FI' 'FR'
 'IE' 'IS' 'IT' 'LT' 'LU' 'LV' 'MK' 'MT' 'PL' 'PT' 'RO' 'SE' 'SK' 'TR'
 'UK']
[2010]
[ 7.72   nan 24.53 ... 29.85 24.72 33.61]
['s' 'c' nan 'd']

In [116]:
for i in df10.dtypes[df10.dtypes != "float64"].index:
    print(df10[i].unique())

['ESTAT:EARN_SES10_14(1.0)']
['30/01/17 23:00:00']
['A']
['EUR' 'PC' 'PPS']
['ERN' 'OPAY' 'E_F_M_PC' 'OP_E_PC']
['GE10' 'TOTAL']
['OC0' 'OC1' 'OC1-5' 'OC2' 'OC3' 'OC4' 'OC5' 'OC6' 'OC7' 'OC7-9' 'OC8'
 'OC9' 'TOTAL']
['TOTAL' 'Y30-39' 'Y40-49' 'Y50-59' 'Y_GE60' 'Y_LT30']
['F' 'M' 'T']
['EU25' 'EU27_2007' 'EU28' 'HU' 'EA13' 'EA16' 'EA17' 'EU15' 'HR' 'NL' 'NO'
 'SI' 'AT' 'BE' 'BG' 'CH' 'CY' 'CZ' 'DE' 'DK' 'EE' 'EL' 'ES' 'FI' 'FR'
 'IE' 'IS' 'IT' 'LT' 'LU' 'LV' 'MK' 'MT' 'PL' 'PT' 'RO' 'SE' 'SK' 'TR'
 'UK']
[2010]
['s' 'c' nan 'd']

In [71]:
cwd=os.getcwd()[:-4]
df18 = pd.read_csv(f'{cwd}Data/Eurostat/csv/EARN_SES18_14.csv')
df14 = pd.read_csv(f'{cwd}Data/Eurostat/csv/EARN_SES14_14.csv')
df10 = pd.read_csv(f'{cwd}Data/Eurostat/csv/EARN_SES10_14.csv')
df06 = pd.read_csv(f'{cwd}Data/Eurostat/csv/EARN_SES06_14.csv')
df06.head(4)

,DATAFLOW,LAST UPDATE,freq,sizeclas,age,unit,isco88,indic_se,sex,geo,TIME_PERIOD,OBS_VALUE,OBS_FLAG
0,ESTAT:EARN_SES06_14(1.0),31/01/17 23:00:00,A,GE10,TOTAL,EUR,ISCO0,ERN,F,DK,2006,30.48,NaN
1,ESTAT:EARN_SES06_14(1.0),31/01/17 23:00:00,A,GE10,TOTAL,EUR,ISCO0,ERN,F,EA13,2006,10.90,NaN
2,ESTAT:EARN_SES06_14(1.0),31/01/17 23:00:00,A,GE10,TOTAL,EUR,ISCO0,ERN,F,EA16,2006,10.90,s
3,ESTAT:EARN_SES06_14(1.0),31/01/17 23:00:00,A,GE10,TOTAL,EUR,ISCO0,ERN,F,EL,2006,NaN,c

In [72]:
df14.currency.unique()
df14.geo.unique()
df14.isco08.unique()

array(['OC0', 'OC1', 'OC1-5', 'OC2', 'OC3', 'OC4', 'OC5', 'OC6', 'OC7',
       'OC7-9', 'OC8', 'OC9', 'TOTAL'], dtype=object)

In [73]:
df06.isco88.unique()

array(['ISCO0', 'ISCO1', 'ISCO1-5', 'ISCO2', 'ISCO3', 'ISCO4', 'ISCO5',
       'ISCO6', 'ISCO7', 'ISCO7-9', 'ISCO8', 'ISCO9', 'TOTAL', 'UNK'],
      dtype=object)

### Import of additional years